In [1]:
import pandas as pd

### 1. 
Given a list, output the corresponding pandas series

### 2.

Given a series, output the corresponding pandas series with odd indexes only

### 3.

Generate the series of dates from 1st May, 2021 to 12th May, 2021 (both inclusive)

### 4.

Apply the function, f(x) = x/2 on each and every element of a given pandas series

### 5.

Given a dictionary, convert it into corresponding dataframe and display it

### 6.

Given a 2D List, convert it into corresponding dataframe and display it

In [ ]:
lists = [[1, 'Kati', 30],
         [2, 'Anna', 33],
         [3, 'Emma', 36]]

### 7.

Given a data.csv file, read it into a dataframe and display it

### 8.

Import the data.csv and change the index of a dataframe from the default indexes to a particular id column

### 9.

Import the data.csv (say, with custom indexing), sort it by it's index

### 10.

Import the data.csv, sort it by multiple columns

### 11.

Import the data.csv, add custom index, set to default indexing and display it

### 12.

Import the data.csv and select the name column and display it

### 13.

Import the data csv, select first 2 rows and output them

### 14.

Import the data csv, select rows with age greater than or equal to 24

### 15.

Given is a dataframe showing name, occupation, salary of people. Find the average salary per occupation

```
     name       occ  salary
0   Kati  engineer   60000
1   Anna    doctor   70000
2   Emma  engineer   50000
3   Kitti   doctor   60000
4   Lotti   doctor   65000
```

### 16.

Given a dataframe with NaN Values, fill the NaN values with 0

```
     name       occ  salary
0   Kati  engineer   60000
1   Anna    doctor   Nan
2   Emma  engineer   50000
3   Kitti   doctor   Nan
4   Lotti   doctor   65000
```

### 17.

Given is a dataframe showing Company Names (cname) and corresponding Profits (profit). Convert the values of Profit column such that values in it greater than 0 are set to True and the rest are set to False.

```
                cname  profit
0     Banana Republic  -10000
1               Apple   10000
2              Orange   -5000
```

### 18.

Given are 2 dataframes, with one dataframe containing Employee ID (eid), Employee Name (ename) and Stipend (stipend) and the other dataframe containing Employee ID (eid) and designation of the employee (designation). Output the Dataframe containing Employee ID (eid), Employee Name (ename), Stipend (stipend) and Position (position).

```
   eid   ename  stipend
0    1     Sid    10000
1    2     Tom    10000
2    3     Ron     5000
3    4   Harry    15000

   eid         position
0    1         employee
1    2         employee
2    3           intern
3    4  senior_employee

   eid   ename  stipend         position
0    1     Sid    10000         employee
1    2     Tom    10000         employee
2    3     Ron     5000           intern
3    4   Harry    15000  senior_employee
```

### 19.

Given a dataframe, output the non-null count and data-type for every column

```
eid   ename  stipend         position
0    1     Sid    10000         employee
1    2     Tom    10000         employee
2    3     Ron     5000           intern
3    4   Harry    15000  senior_employee
```

### 20.

Given a dataframe, generate the statistical summary of all the numerical features present in it

```
   eid   ename  stipend         position
0    1     Sid    10000         employee
1    2  Ramesh    10000         employee
2    3     Ron     5000           intern
3    4   Harry    15000  senior_employee

            eid       stipend
count  4.000000      4.000000
mean   2.500000  10000.000000
std    1.290994   4082.482905
min    1.000000   5000.000000
25%    1.750000   8750.000000
50%    2.500000  10000.000000
75%    3.250000  11250.000000
max    4.000000  15000.000000
```